lab4/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

9
(
    inlet
    {
        type            patch;
        nFaces          79;
        startFace       25368;
    }
    outlet
    {
        type            patch;
        nFaces          79;
        startFace       25447;
    }
    inlet_pipe
    {
        type            wall;
        nFaces          720;
        startFace       25526;
    }
    outlet_pipe
    {
        type            wall;
        nFaces          720;
        startFace       26246;
    }
    top
    {
        type            wall;
        nFaces          1002;
        startFace       26966;
    }
    front
    {
        type            wall;
        nFaces          974;
        startFace       27968;
    }
    bottom
    {
        type            wall;
        nFaces          942;
        startFace       28942;
    }
    left_board
    {
        type            wall;
        nFaces          274;
        startFace       29884;
    }
    right_board
    {
        type            wall;
        nFaces          274;
        startFace       30158;
    }
)

// ************************************************************************* //
